### In this project, we'll work with data from the CIA World Factbook, a compendium of statistics about all of the countries on Earth.

#### Here are the descriptions for some of the columns:

1. name - The name of the country.
2. area - The total land and sea area of the country.
3. population - The country's population.
4. population_growth- The country's population growth as a percentage.
5. birth_rate - The country's birth rate, or the number of births a year per 1,000 people.
6. death_rate - The country's death rate, or the number of death a year per 1,000 people.
7. area- The country's total area (both land and water).
8. area_land - The country's land area in square kilometers.
9. area_water - The country's waterarea in square kilometers.

##### Connecting to the database

In [55]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

##### Querying all table names

In [56]:
%%sql
SELECT * FROM sqlite_master WHERE type='table';

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

##### Visualizing the table

In [57]:
%%sql
SELECT * From facts limit 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

##### Write a single query that returns the:

1. Minimum population
2. Maximum population
3. Minimum population growth
4. Maximum population growth

In [58]:
%%sql
select min(population), max(population), min(population_growth), max(population_growth) from facts;

Done.

[(0, 7256490011, 0.0, 4.02)]

##### A query that returns the countrie(s) with the minimum population.

In [59]:
%%sql
select * from facts where population = (Select Min(population) from facts);

Done.

[(250, 'ay', 'Antarctica', None, 280000, None, 0, None, None, None, None)]

##### A query that returns the countrie(s) with the maximum population.

In [60]:
%%sql
Select * from facts where population = (Select Max(population) from facts)

Done.

[(261, 'xx', 'World', None, None, None, 7256490011, 1.08, 18.6, 7.8, None)]

##### The average value for the population and area columns

In [61]:
%%sql
Select AVG(population), AVG(area) from facts;

Done.

[(62094928.32231405, 555093.546184739)]

##### A query that finds all countries meeting both of the following conditions:
1. The population is above average.
2. The area is below average.

In [62]:
%%sql
Select name, area, population from facts where
(population > (Select AVG(population) from facts)) AND 
(area > (Select AVG(Area) from facts))

Done.

[('Brazil', 8515770, 204259812),
 ('China', 9596960, 1367485388),
 ('Congo, Democratic Republic of the', 2344858, 79375136),
 ('Egypt', 1001450, 88487396),
 ('Ethiopia', 1104300, 99465819),
 ('France', 643801, 66553766),
 ('India', 3287263, 1251695584),
 ('Indonesia', 1904569, 255993674),
 ('Iran', 1648195, 81824270),
 ('Mexico', 1964375, 121736809),
 ('Nigeria', 923768, 181562056),
 ('Pakistan', 796095, 199085847),
 ('Russia', 17098242, 142423773),
 ('Turkey', 783562, 79414269),
 ('United States', 9826675, 321368864),
 ('European Union', 4324782, 513949445)]

##### Which countries have the highest ratios of water to land? Which countries have more water than land?

In [63]:
%%sql
select name from facts
where (cast(area_water as float)/cast(area_water as float) > 1.0);

Done.

[]

##### Which countries will add the most people to their population next year?

In [64]:
%%sql
select name, population_growth, population,
max(cast(population_growth as float)*cast(population as float)-population) as 'added_population'
from facts where name != "World";

Done.

[('India', 1.22, 1251695584, 275373028.48)]

##### Which countries have a higher death rate than birth rate?

In [65]:
%%sql
Select name from facts where death_rate > birth_rate;

Done.

[('Austria',),
 ('Belarus',),
 ('Bosnia and Herzegovina',),
 ('Bulgaria',),
 ('Croatia',),
 ('Czech Republic',),
 ('Estonia',),
 ('Germany',),
 ('Greece',),
 ('Hungary',),
 ('Italy',),
 ('Japan',),
 ('Latvia',),
 ('Lithuania',),
 ('Moldova',),
 ('Monaco',),
 ('Poland',),
 ('Portugal',),
 ('Romania',),
 ('Russia',),
 ('Serbia',),
 ('Slovenia',),
 ('Ukraine',),
 ('Saint Pierre and Miquelon',)]